case/Couette_kn0.02_CLL_Slip_Loyalka_sigma_t=1.0_alpha_n=1.0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    up
    {
        type            CLL_SlipU_Loyalka;
        accommodationCoeff_t  1.0;
        accommodationCoeff_n  1.0;
        Uwall           uniform (350 0 0);
        value           uniform (350 0 0);
        thermalCreep    true;
        curvature       true;
    }

    down
    {
        type            CLL_SlipU_Loyalka;
        accommodationCoeff_t  1.0;
        accommodationCoeff_n  1.0;
        Uwall           uniform (-350 0 0);
        value           uniform (-350 0 0);
        thermalCreep    true;
        curvature       true;
    }
    
    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }

    defaultPatch
    {
        type            empty;
    }

}

// ************************************************************************* //
