case/Couette_kn0.02_CLL_Slip_Loyalka_sigma_t=1.0_alpha_n=1.0/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 243.9378;

boundaryField
{

    up
    {
        type            zeroGradient;
    }

    down
    {
        type            zeroGradient;
    }

    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }

    defaultPatch
    {
        type            empty;
    }

}

// ************************************************************************* //
