case/Couette_kn0.02_CLL_Slip_Loyalka_sigma_t=1.0_alpha_n=1.0/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 3(0.266417 0.266417 0.266417);
    }
    down
    {
        type            calculated;
        value           uniform 0.266417;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
