case/Couette_kn0.02_CLL_Slip_Loyalka_sigma_t=1.0_alpha_n=1.0/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       powerlaw;
    // thermo          hConst;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}


mixture
{
    specie
    {
        molWeight       39.948;
    }
    // thermodynamics
    // {
    //     Cp              520;
    //     Hf              0;
    // }
    thermodynamics
    {
        Tlow            20;
        Thigh           60000;
        Tcommon         1000;
        highCpCoeffs    ( 2.5 0 0 0 0 -745.375 4.37967 );
        lowCpCoeffs     ( 2.5 0 0 0 0 -745.375 4.37967 );
    }
    transport
    {
        mu0             2.117e-5;
        T_ref           273;
        w               0.81;
        Pr              0.67;
    }

}



// ************************************************************************* //
