case/Couette_kn0.02_CLL_Slip_Loyalka_sigma_t=1.0_alpha_n=1.0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    up
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3;
        startFace       2497;
    }
    down
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3;
        startFace       2500;
    }
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          500;
        startFace       2503;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-2e-05 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          500;
        startFace       3003;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (2e-05 0 0);
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3000;
        startFace       3503;
    }
)

// ************************************************************************* //
