case/Couette_kn0.02_CLL_Slip_Loyalka_sigma_t=1.0_alpha_n=1.0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-1e-2  0  -0.5)
    ( 1e-2  0  -0.5)
    ( 1e-2  1  -0.5)
    (-1e-2  1  -0.5)

    (-1e-2  0   0.5)
    ( 1e-2  0   0.5)
    ( 1e-2  1   0.5)
    (-1e-2  1   0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (3 500 1) simpleGrading (1 1 1)
);

edges
(
    
);

defaultPatch
{
    type empty;
}

boundary
(
    up
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }
    down
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    left
    {
        type cyclic;
        neighbourPatch right;
        faces
        (
            (0 3 4 7)
        );
    }
    right
    {
        type cyclic;
        neighbourPatch left;
        faces
        (
            (1 2 6 5)
        );
    }
    
);


// ************************************************************************* //
